# Homework 2

**Case <- function**

In [2]:
%load_ext sql
%sql sqlite:///Sales.db

# 1.	Используя операторы языка SQL, 
создайте табличку “sales”. Заполните ее данными

In [3]:
%%sql 
# Если id везде одинаковый, значит это либо ошибка либо это внешний ключ от таблицы orders. Но создаю как обычный айдишник с инкрементом
CREATE TABLE if not exists sales(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    order_date DATE NOT NULL,
    bucket VARCHAR(50) NOT NULL
)

 * sqlite:///Sales.db
Done.

[]

In [4]:
%%sql
INSERT INTO sales (order_date, bucket)
VALUES ('2021-01-01', '101 to 300'),
    ('2021-01-02', '101 to 300'),
    ('2021-01-02', 'less than equal to 100'),
    ('2021-01-04', '101 to 300'),
    ('2021-01-05', 'greater than 300')

 * sqlite:///Sales.db
5 rows affected.

[]

In [5]:
%sql SELECT * FROM sales

 * sqlite:///Sales.db
Done.

[(1, '2021-01-01', '101 to 300'),
 (2, '2021-01-02', '101 to 300'),
 (3, '2021-01-02', 'less than equal to 100'),
 (4, '2021-01-04', '101 to 300'),
 (5, '2021-01-05', 'greater than 300')]

In [6]:
%%sql 

SELECT *,
CASE
    WHEN bucket = '101 to 300' THEN 'Average order'
    WHEN bucket = 'less than equal to 100' THEN 'Small order'
    ELSE 'Large order'
END AS Order_value

FROM sales

 * sqlite:///Sales.db
Done.

[(1, '2021-01-01', '101 to 300', 'Average order'),
 (2, '2021-01-02', '101 to 300', 'Average order'),
 (3, '2021-01-02', 'less than equal to 100', 'Small order'),
 (4, '2021-01-04', '101 to 300', 'Average order'),
 (5, '2021-01-05', 'greater than 300', 'Large order')]

In [7]:
%%sql 
CREATE TABLE if not exists orders(
    orderid INTEGER PRIMARY KEY AUTOINCREMENT,
    employeeid CHAR(3) NOT NULL,
    amount DECIMAL NOT NULL,
    orderstatus VARCHAR(30) NOT NULL
)

 * sqlite:///Sales.db
Done.

[]

# 3.	Создайте таблицу “orders”, заполните ее значениями. Покажите “полный” статус заказа, используя оператор CASE

In [9]:
%%sql
INSERT INTO ORDERS (employeeid, amount, orderstatus)
VALUES 
    ('e03', 15.00,'OPEN'),
    ('e01', 25.50,'OPEN'),
    ('e05', 100.70,'CLOSED'),
    ('e02', 22.18,'OPEN'),
    ('e04', 9.50,'CANCELLED'),
    ('e04', 99.99,'OPEN')

 * sqlite:///Sales.db
6 rows affected.

[]

Проверим:

In [10]:
%sql SELECT * FROM ORDERS

 * sqlite:///Sales.db
Done.

[(1, 'e03', 15, 'OPEN'),
 (2, 'e01', 25.5, 'OPEN'),
 (3, 'e05', 100.7, 'CLOSED'),
 (4, 'e02', 22.18, 'OPEN'),
 (5, 'e04', 9.5, 'CANCELLED'),
 (6, 'e04', 99.99, 'OPEN')]

In [11]:
%%sql 

SELECT *,
CASE
    WHEN ORDERSTATUS = 'OPEN' THEN 'Order is in open state'
    WHEN ORDERSTATUS = 'CLOSED' THEN 'Order is closed'
    ELSE 'Order is cancelled'
END AS Full_order_status

FROM orders

 * sqlite:///Sales.db
Done.

[(1, 'e03', 15, 'OPEN', 'Order is in open state'),
 (2, 'e01', 25.5, 'OPEN', 'Order is in open state'),
 (3, 'e05', 100.7, 'CLOSED', 'Order is closed'),
 (4, 'e02', 22.18, 'OPEN', 'Order is in open state'),
 (5, 'e04', 9.5, 'CANCELLED', 'Order is cancelled'),
 (6, 'e04', 99.99, 'OPEN', 'Order is in open state')]

# Чем 0 отличается от NULL?
Сильно спорный вопрос, так как в некоторых данных 0 - это такое же пропущенное значение как и - и ? и null, но непосредственно в SQL, 0 и NULL - это два разных концепта и имеют различное значение.
В целом, 0 - это конкретное числовое значение, которое обозначает ноль или отсутствие какого-либо количества или величины. Оно может быть использовано в вычислениях и операциях с числами.

NULL - это специальное значение, которое указывает на отсутствие значения или неизвестное значение. Оно не является числовым значением и не может быть использовано в вычислениях или операциях с числами. NULL может быть присвоено столбцу, чтобы указать, что для данной строки значение отсутствует или неизвестно.

Для проверки наличия или отсутствия значения NULL (в некоторых случаях оно отображается как None) используются операторы IS NULL и IS NOT NULL , так как при сравнении таких значений различными операторами мы получим не булево значение а null, что может привести к ошибкам.